Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/qspi.h
/* -------- QSPI_RICR : (QSPI Offset: 0x3C) (R/W 32) Read Instruction Code Register -------- */
#define QSPI_RICR_RDINST_Pos                  _U_(0)                                               /**< (QSPI_RICR) Read Instruction Code Position */
#define QSPI_RICR_RDINST_Msk                  (_U_(0xFF) << QSPI_RICR_RDINST_Pos)                  /**< (QSPI_RICR) Read Instruction Code Mask */
#define QSPI_RICR_RDINST(value)               (QSPI_RICR_RDINST_Msk & ((value) << QSPI_RICR_RDINST_Pos))
#define QSPI_RICR_RDOPT_Pos                   _U_(16)                                              /**< (QSPI_RICR) Read Option Code Position */
#define QSPI_RICR_RDOPT_Msk                   (_U_(0xFF) << QSPI_RICR_RDOPT_Pos)                   /**< (QSPI_RICR) Read Option Code Mask */
#define QSPI_RICR_RDOPT(value)                (QSPI_RICR_RDOPT_Msk & ((value) << QSPI_RICR_RDOPT_Pos))
#define QSPI_RICR_Msk                         _U_(0x00FF00FF)                                      /**< (QSPI_RICR) Register Mask  */


/* -------- QSPI_SMR : (QSPI Offset: 0x40) (R/W 32) Scrambling Mode Register -------- */
#define QSPI_SMR_SCREN_Pos                    _U_(0)                                               /**< (QSPI_SMR) Scrambling/Unscrambling Enable Position */
#define QSPI_SMR_SCREN_Msk                    (_U_(0x1) << QSPI_SMR_SCREN_Pos)                     /**< (QSPI_SMR) Scrambling/Unscrambling Enable Mask */
#define QSPI_SMR_SCREN(value)                 (QSPI_SMR_SCREN_Msk & ((value) << QSPI_SMR_SCREN_Pos))
#define   QSPI_SMR_SCREN_DISABLED_Val         _U_(0x0)                                             /**< (QSPI_SMR) The scrambling/unscrambling is disabled.  */
#define   QSPI_SMR_SCREN_ENABLED_Val          _U_(0x1)                                             /**< (QSPI_SMR) The scrambling/unscrambling is enabled.  */
#define QSPI_SMR_SCREN_DISABLED               (QSPI_SMR_SCREN_DISABLED_Val << QSPI_SMR_SCREN_Pos)  /**< (QSPI_SMR) The scrambling/unscrambling is disabled. Position  */
#define QSPI_SMR_SCREN_ENABLED                (QSPI_SMR_SCREN_ENABLED_Val << QSPI_SMR_SCREN_Pos)   /**< (QSPI_SMR) The scrambling/unscrambling is enabled. Position  */
#define QSPI_SMR_RVDIS_Pos                    _U_(1)                                               /**< (QSPI_SMR) Scrambling/Unscrambling Random Value Disable Position */
#define QSPI_SMR_RVDIS_Msk                    (_U_(0x1) << QSPI_SMR_RVDIS_Pos)                     /**< (QSPI_SMR) Scrambling/Unscrambling Random Value Disable Mask */
#define QSPI_SMR_RVDIS(value)                 (QSPI_SMR_RVDIS_Msk & ((value) << QSPI_SMR_RVDIS_Pos))
#define QSPI_SMR_SCRKL_Pos                    _U_(2)                                               /**< (QSPI_SMR) Scrambling Key Lock Position */
#define QSPI_SMR_SCRKL_Msk                    (_U_(0x1) << QSPI_SMR_SCRKL_Pos)                     /**< (QSPI_SMR) Scrambling Key Lock Mask */
#define QSPI_SMR_SCRKL(value)                 (QSPI_SMR_SCRKL_Msk & ((value) << QSPI_SMR_SCRKL_Pos))
#define QSPI_SMR_Msk                          _U_(0x00000007)                                      /**< (QSPI_SMR) Register Mask  */


/* -------- QSPI_SKR : (QSPI Offset: 0x44) ( /W 32) Scrambling Key Register -------- */
#define QSPI_SKR_USRK_Pos                     _U_(0)                                               /**< (QSPI_SKR) User Scrambling Key Position */
#define QSPI_SKR_USRK_Msk                     (_U_(0xFFFFFFFF) << QSPI_SKR_USRK_Pos)               /**< (QSPI_SKR) User Scrambling Key Mask */
#define QSPI_SKR_USRK(value)                  (QSPI_SKR_USRK_Msk & ((value) << QSPI_SKR_USRK_Pos))
#define QSPI_SKR_Msk                          _U_(0xFFFFFFFF)                                      /**< (QSPI_SKR) Register Mask  */


/* -------- QSPI_WPMR : (QSPI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define QSPI_WPMR_WPEN_Pos                    _U_(0)                                               /**< (QSPI_WPMR) Write Protection Enable Position */
#define QSPI_WPMR_WPEN_Msk                    (_U_(0x1) << QSPI_WPMR_WPEN_Pos)                     /**< (QSPI_WPMR) Write Protection Enable Mask */
#define QSPI_WPMR_WPEN(value)                 (QSPI_WPMR_WPEN_Msk & ((value) << QSPI_WPMR_WPEN_Pos))
#define QSPI_WPMR_WPITEN_Pos                  _U_(1)                                               /**< (QSPI_WPMR) Write Protection Interrupt Enable Position */
#define QSPI_WPMR_WPITEN_Msk                  (_U_(0x1) << QSPI_WPMR_WPITEN_Pos)                   /**< (QSPI_WPMR) Write Protection Interrupt Enable Mask */
#define QSPI_WPMR_WPITEN(value)               (QSPI_WPMR_WPITEN_Msk & ((value) << QSPI_WPMR_WPITEN_Pos))
#define QSPI_WPMR_WPCREN_Pos                  _U_(2)                                               /**< (QSPI_WPMR) Write Protection Control Register Enable Position */
#define QSPI_WPMR_WPCREN_Msk                  (_U_(0x1) << QSPI_WPMR_WPCREN_Pos)                   /**< (QSPI_WPMR) Write Protection Control Register Enable Mask */
#define QSPI_WPMR_WPCREN(value)               (QSPI_WPMR_WPCREN_Msk & ((value) << QSPI_WPMR_WPCREN_Pos))
#define QSPI_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (QSPI_WPMR) Write Protection Key Position */
#define QSPI_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << QSPI_WPMR_WPKEY_Pos)               /**< (QSPI_WPMR) Write Protection Key Mask */
#define QSPI_WPMR_WPKEY(value)                (QSPI_WPMR_WPKEY_Msk & ((value) << QSPI_WPMR_WPKEY_Pos))
#define   QSPI_WPMR_WPKEY_PASSWD_Val          _U_(0x515350)                                        /**< (QSPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define QSPI_WPMR_WPKEY_PASSWD                (QSPI_WPMR_WPKEY_PASSWD_Val << QSPI_WPMR_WPKEY_Pos)  /**< (QSPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define QSPI_WPMR_Msk                         _U_(0xFFFFFF07)                                      /**< (QSPI_WPMR) Register Mask  */


/* -------- QSPI_WPSR : (QSPI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define QSPI_WPSR_WPVS_Pos                    _U_(0)                                               /**< (QSPI_WPSR) Write Protection Violation Status Position */
#define QSPI_WPSR_WPVS_Msk                    (_U_(0x1) << QSPI_WPSR_WPVS_Pos)                     /**< (QSPI_WPSR) Write Protection Violation Status Mask */
#define QSPI_WPSR_WPVS(value)                 (QSPI_WPSR_WPVS_Msk & ((value) << QSPI_WPSR_WPVS_Pos))
#define QSPI_WPSR_WPVSRC_Pos                  _U_(8)                                               /**< (QSPI_WPSR) Write Protection Violation Source Position */
#define QSPI_WPSR_WPVSRC_Msk                  (_U_(0xFF) << QSPI_WPSR_WPVSRC_Pos)                  /**< (QSPI_WPSR) Write Protection Violation Source Mask */
#define QSPI_WPSR_WPVSRC(value)               (QSPI_WPSR_WPVSRC_Msk & ((value) << QSPI_WPSR_WPVSRC_Pos))
#define QSPI_WPSR_Msk                         _U_(0x0000FF01)                                      /**< (QSPI_WPSR) Register Mask  */


/* -------- QSPI_VERSION : (QSPI Offset: 0xFC) ( R/ 32) Version Register -------- */
#define QSPI_VERSION_VERSION_Pos              _U_(0)                                               /**< (QSPI_VERSION) Hardware Module Version Position */
#define QSPI_VERSION_VERSION_Msk              (_U_(0xFFF) << QSPI_VERSION_VERSION_Pos)             /**< (QSPI_VERSION) Hardware Module Version Mask */
#define QSPI_VERSION_VERSION(value)           (QSPI_VERSION_VERSION_Msk & ((value) << QSPI_VERSION_VERSION_Pos))
#define QSPI_VERSION_MFN_Pos                  _U_(16)                                              /**< (QSPI_VERSION) Metal Fix Number Position */
#define QSPI_VERSION_MFN_Msk                  (_U_(0x7) << QSPI_VERSION_MFN_Pos)                   /**< (QSPI_VERSION) Metal Fix Number Mask */
#define QSPI_VERSION_MFN(value)               (QSPI_VERSION_MFN_Msk & ((value) << QSPI_VERSION_MFN_Pos))
#define QSPI_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (QSPI_VERSION) Register Mask  */


/** \brief QSPI register offsets definitions */
#define QSPI_CR_REG_OFST               (0x00)              /**< (QSPI_CR) Control Register Offset */
#define QSPI_MR_REG_OFST               (0x04)              /**< (QSPI_MR) Mode Register Offset */
#define QSPI_RDR_REG_OFST              (0x08)              /**< (QSPI_RDR) Receive Data Register Offset */
#define QSPI_TDR_REG_OFST              (0x0C)              /**< (QSPI_TDR) Transmit Data Register Offset */
#define QSPI_SR_REG_OFST               (0x10)              /**< (QSPI_SR) Status Register Offset */
#define QSPI_IER_REG_OFST              (0x14)              /**< (QSPI_IER) Interrupt Enable Register Offset */
#define QSPI_IDR_REG_OFST              (0x18)              /**< (QSPI_IDR) Interrupt Disable Register Offset */
#define QSPI_IMR_REG_OFST              (0x1C)              /**< (QSPI_IMR) Interrupt Mask Register Offset */
#define QSPI_SCR_REG_OFST              (0x20)              /**< (QSPI_SCR) Serial Clock Register Offset */
#define QSPI_IAR_REG_OFST              (0x30)              /**< (QSPI_IAR) Instruction Address Register Offset */
#define QSPI_WICR_REG_OFST             (0x34)              /**< (QSPI_WICR) Write Instruction Code Register Offset */
#define QSPI_IFR_REG_OFST              (0x38)              /**< (QSPI_IFR) Instruction Frame Register Offset */
#define QSPI_RICR_REG_OFST             (0x3C)              /**< (QSPI_RICR) Read Instruction Code Register Offset */
#define QSPI_SMR_REG_OFST              (0x40)              /**< (QSPI_SMR) Scrambling Mode Register Offset */
#define QSPI_SKR_REG_OFST              (0x44)              /**< (QSPI_SKR) Scrambling Key Register Offset */
#define QSPI_WPMR_REG_OFST             (0xE4)              /**< (QSPI_WPMR) Write Protection Mode Register Offset */
#define QSPI_WPSR_REG_OFST             (0xE8)              /**< (QSPI_WPSR) Write Protection Status Register Offset */
#define QSPI_VERSION_REG_OFST          (0xFC)              /**< (QSPI_VERSION) Version Register Offset */

